       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMBERS.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1           PIC 9(5).
       01  NUM2           PIC 9(5).
       01  RESULT         PIC 9(7).
       
       PROCEDURE DIVISION.
           PERFORM GET-NUMBERS.
           PERFORM CALCULATE.
           PERFORM DISPLAY-RESULT.
           STOP RUN.
       
       GET-NUMBERS.
           MOVE 5 TO NUM1.
           MOVE 10 TO NUM2.
       
       CALCULATE.
           COMPUTE RESULT = NUM1 + NUM2.
       
       DISPLAY-RESULT.
           DISPLAY "Number 1: " NUM1.
           DISPLAY "Number 2: " NUM2.
           DISPLAY "Result: " RESULT.
